In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = pd.read_csv('Complete_Black_Friday_data.csv')

In [4]:
data = data.iloc[:500000, :]

In [5]:
data.shape

(500000, 11)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500000 entries, 0 to 499999
Data columns (total 11 columns):
Unnamed: 0                    500000 non-null int64
Age                           500000 non-null object
City_Category                 500000 non-null object
Gender                        500000 non-null object
Marital_Status                500000 non-null int64
Occupation                    500000 non-null int64
Product_Category_1            500000 non-null int64
Product_Category_2            500000 non-null int64
Product_Category_3            500000 non-null int64
Purchase                      500000 non-null float64
Stay_In_Current_City_Years    500000 non-null object
dtypes: float64(1), int64(6), object(4)
memory usage: 42.0+ MB

In [10]:
data.head()

,Unnamed: 0,Age,City_Category,Gender,Marital_Status,Occupation,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Stay_In_Current_City_Years
0,0,0-17,A,F,0,10,3,-2147483648,-2147483648,8370.0,2
1,1,0-17,A,F,0,10,1,6,14,15200.0,2
2,2,0-17,A,F,0,10,12,-2147483648,-2147483648,1422.0,2
3,3,0-17,A,F,0,10,12,14,-2147483648,1057.0,2
4,4,55+,C,M,0,16,8,-2147483648,-2147483648,7969.0,4+

![title](Black Friday/feature_importance.png)

In [9]:
from sklearn.cluster import KMeans
from sklearn.preprocessing import StandardScaler
from sklearn.manifold import TSNE